'number' + 3 + 3; // результат number33, 1е додавання відбувається зі стрінгою та числом 3,і це становиться вже стрінга number3, а потім знову додається 3 до вже нової стрінги number3, через те що в нас спочакту є рядок, число 3 js перетворило на рядок і тд
null + 3; //результат 3, null перетворюється на 0 у контексті чисел, 0+3=3
5 && "qwerty"; //результат qwerty, так як перший операнд 5 є істенним, то перевіряємо другий і повертаємо "qwerty"
+'40' + +'2' + "hillel"; //результат 42hillel, унарний + перетворює рядки '40' та '2' на числа, потім відбувається додавання чисил (42) та конкатенація із рядком "hillel"
'10' - 5 === 6; //резултат false, оператор - перетворює рядок '10' на число, тобто 10-5=5, 5 не дорівнює 6 (непроходить строгу рівність), тому повертає false
true + false; //результат 1, js намагається перетворити true і false на числа, через оператор +, true є 1, false є 0, 1+0=1
'4px' - 3; //результат NaN, так як оперетор - не може перевести рядок '4px' у число, то обчислення не може відбутися
'4' - 3; //результат 1, оперетор - перетворює рядок '4' на число, тобто 4-3=1 
'6' + 3 ** 0; //результат 61, спочатку робиться піднесення до ступеню 3 ** 0, проте число піднесене до 0 ступеню дає 1, потім відбувається конкатенація рядків '6' + '1' = '61'
12 / '6'; //результат 2, через знак ділення рядок '6' перетворюється на число, потім відбувається саме ділення чисел 
'10' + (5 === 6); //результат 10false, числа 5 та 6 не дорівнюють один одному, тому буде false, а потім відбувається конкатенація рядків 
null == ''; //результат false, нестроге порівняння не переводить null у рядок, тому видає false
3 ** (9 / 3); //результат 27, спочатку робиться ділення чисел (9 / 3), що у результаті дає 3, після цього 3 підводиться до 3го ступеню
!!'false' == !!'true'; //результат true, це через те що рядок 'false' не порожній і це true, другий рядок 'true' теж не порожній і тому це також true
0 || '0' && 1; //результат 1, по пріорітету спочатку виконується операція '0' && 1, через те що 1й рядок дає true, то js повертає дргуе значення 1; потім йде обчислення 0 || 1, через те що 1е значення 0 це false, то js повертає друге значення 1 
(+null == false) < 1; //результат false, + перед null перетворює null у число 0, false завжи це 0, тобто 0 == 0 це true, true < 1, true це завжди 1, а тому 1 не може бути більше 1   
false && true || true; // результат true, оператор && по спочатку вибирає false, потом вираз стає false || true, оператор || повертає перше істинне значення
false && (false || true); //результат false, спочатку йде обчислення (false || true), що дає true, так як цей оперетор || повертає істинне значення, потім вираз стає false && true, оператор && повертає перше хибне значення, тобто false 
(+null == false) < 1 ** 5; //результат false, починаємо із дужок -> + перетворює null у число 0, false також 0, тобто (0 == 0) це true, тобто 1; далі підносимо 1 до 5 степені, що дає 1; 1 не є більше 1 
